ab-logs/ab-log-django-1.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=1
Document Length:        1909 bytes

Concurrency Level:      1
Time taken for tests:   0.925 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      20390 bytes
HTML transferred:       19090 bytes
Requests per second:    10.81 [#/sec] (mean)
Time per request:       92.481 [ms] (mean)
Time per request:       92.481 [ms] (mean, across all concurrent requests)
Transfer rate:          21.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       35   92  74.1     36     191
Processing:     0    0   0.0      0       0
Waiting:        0    0   0.0      0       0
Total:         35   92  74.1     36     191

Percentage of the requests served within a certain time (ms)
  50%     36
  66%    167
  75%    169
  80%    186
  90%    191
  95%    191
  98%    191
  99%    191
 100%    191 (longest request)