ab-logs/ab-log-django-100.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=100
Document Length:        228756 bytes

Concurrency Level:      1
Time taken for tests:   30.310 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      2288860 bytes
HTML transferred:       2287560 bytes
Requests per second:    0.33 [#/sec] (mean)
Time per request:       3030.954 [ms] (mean)
Time per request:       3030.954 [ms] (mean, across all concurrent requests)
Transfer rate:          73.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       65  367 924.8     79    2999
Processing:     2 2664 937.6   2928    3092
Waiting:        0 2662 937.6   2926    3090
Total:       2967 3031  62.3   3001    3164

Percentage of the requests served within a certain time (ms)
  50%   3001
  66%   3023
  75%   3086
  80%   3091
  90%   3164
  95%   3164
  98%   3164
  99%   3164
 100%   3164 (longest request)