ab-logs/ab-log-django-500.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=500
Document Length:        1119348 bytes

Concurrency Level:      1
Time taken for tests:   155.355 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      11194780 bytes
HTML transferred:       11193480 bytes
Requests per second:    0.06 [#/sec] (mean)
Time per request:       15535.452 [ms] (mean)
Time per request:       15535.452 [ms] (mean, across all concurrent requests)
Transfer rate:          70.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing: 15003 15535 396.8  15538   16086
Waiting:    15001 15533 396.6  15537   16084
Total:      15003 15535 396.8  15538   16086

Percentage of the requests served within a certain time (ms)
  50%  15538
  66%  15645
  75%  15927
  80%  16061
  90%  16086
  95%  16086
  98%  16086
  99%  16086
 100%  16086 (longest request)