ab-logs/ab-log-falcon-1.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=1
Document Length:        1814 bytes

Concurrency Level:      1
Time taken for tests:   0.297 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      19810 bytes
HTML transferred:       18140 bytes
Requests per second:    33.72 [#/sec] (mean)
Time per request:       29.652 [ms] (mean)
Time per request:       29.652 [ms] (mean, across all concurrent requests)
Transfer rate:          65.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    27   29   1.8     30      32
Waiting:       27   29   1.8     30      32
Total:         27   30   1.9     30      32

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     30
  75%     31
  80%     32
  90%     32
  95%     32
  98%     32
  99%     32
 100%     32 (longest request)