ab-logs/ab-log-falcon-100.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=100
Document Length:        219866 bytes

Concurrency Level:      1
Time taken for tests:   27.653 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      2200350 bytes
HTML transferred:       2198660 bytes
Requests per second:    0.36 [#/sec] (mean)
Time per request:       2765.344 [ms] (mean)
Time per request:       2765.344 [ms] (mean, across all concurrent requests)
Transfer rate:          77.70 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  2720 2765  49.1   2740    2847
Waiting:     2720 2765  49.1   2739    2847
Total:       2720 2765  49.1   2740    2848

Percentage of the requests served within a certain time (ms)
  50%   2740
  66%   2788
  75%   2788
  80%   2845
  90%   2848
  95%   2848
  98%   2848
  99%   2848
 100%   2848 (longest request)