ab-logs/ab-log-falcon-500.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        gunicorn/18.0
Server Hostname:        localhost
Server Port:            8000

Document Path:          /listall/?limit=500
Document Length:        1091066 bytes

Concurrency Level:      1
Time taken for tests:   139.934 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      10912360 bytes
HTML transferred:       10910660 bytes
Requests per second:    0.07 [#/sec] (mean)
Time per request:       13993.400 [ms] (mean)
Time per request:       13993.400 [ms] (mean, across all concurrent requests)
Transfer rate:          76.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing: 13838 13993 166.6  13968   14354
Waiting:    13836 13992 166.6  13966   14352
Total:      13838 13993 166.6  13968   14354

Percentage of the requests served within a certain time (ms)
  50%  13968
  66%  14025
  75%  14120
  80%  14133
  90%  14354
  95%  14354
  98%  14354
  99%  14354
 100%  14354 (longest request)