ab-logs/ab-log-nodejs-1.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /listall/?limit=1
Document Length:        2000 bytes

Concurrency Level:      1
Time taken for tests:   0.299 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      23036 bytes
HTML transferred:       20000 bytes
Requests per second:    33.45 [#/sec] (mean)
Time per request:       29.891 [ms] (mean)
Time per request:       29.891 [ms] (mean, across all concurrent requests)
Transfer rate:          75.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    26   30   3.7     29      39
Waiting:       26   30   3.7     29      39
Total:         27   30   3.7     29      39

Percentage of the requests served within a certain time (ms)
  50%     29
  66%     31
  75%     31
  80%     31
  90%     39
  95%     39
  98%     39
  99%     39
 100%     39 (longest request)