ab-logs/ab-log-nodejs-100.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /listall/?limit=100
Document Length:        240743 bytes

Concurrency Level:      1
Time taken for tests:   26.658 seconds
Complete requests:      10
Failed requests:        0
Write errors:           0
Total transferred:      2410496 bytes
HTML transferred:       2407430 bytes
Requests per second:    0.38 [#/sec] (mean)
Time per request:       2665.783 [ms] (mean)
Time per request:       2665.783 [ms] (mean, across all concurrent requests)
Transfer rate:          88.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  2614 2666  41.7   2661    2735
Waiting:     2613 2665  41.6   2660    2734
Total:       2614 2666  41.7   2661    2735

Percentage of the requests served within a certain time (ms)
  50%   2661
  66%   2675
  75%   2704
  80%   2719
  90%   2735
  95%   2735
  98%   2735
  99%   2735
 100%   2735 (longest request)